Revit 2027 API
ParameterTypeId.RbsAreaBasedLoadType Property
 "Area Based Load Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsAreaBasedLoadType { get; }
Public Shared ReadOnly Property RbsAreaBasedLoadType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsAreaBasedLoadType {
	ForgeTypeId^ get ();
}
static member RbsAreaBasedLoadType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace